espressif/esp-idf/components/esp_psram/esp32/esp_psram_impl_quad.c
    //select pin function gpio
    if ((psram_io->flash_clk_io == MSPI_IOMUX_PIN_NUM_CLK) && (psram_io->flash_clk_io != psram_io->psram_clk_io)) {
        //flash clock signal should come from IO MUX.
        gpio_ll_func_sel(&GPIO, psram_io->flash_clk_io, MSPI_FUNC_NUM);
    } else {
        //flash clock signal should come from GPIO matrix.
        gpio_ll_func_sel(&GPIO, psram_io->flash_clk_io, PIN_FUNC_GPIO);
    }

    gpio_ll_func_sel(&GPIO, psram_io->flash_cs_io,  PIN_FUNC_GPIO);
    gpio_ll_func_sel(&GPIO, psram_io->psram_cs_io,  PIN_FUNC_GPIO);
    gpio_ll_func_sel(&GPIO, psram_io->psram_clk_io, PIN_FUNC_GPIO);
    gpio_ll_func_sel(&GPIO, psram_io->psram_spiq_sd0_io,  PIN_FUNC_GPIO);
    gpio_ll_func_sel(&GPIO, psram_io->psram_spid_sd1_io,  PIN_FUNC_GPIO);
    gpio_ll_func_sel(&GPIO, psram_io->psram_spihd_sd2_io, PIN_FUNC_GPIO);
    gpio_ll_func_sel(&GPIO, psram_io->psram_spiwp_sd3_io, PIN_FUNC_GPIO);

    uint32_t flash_id = g_rom_flashchip.device_id;
    if (flash_id == FLASH_ID_GD25LQ32C) {
        // Set drive ability for 1.8v flash in 80Mhz.
        SET_PERI_REG_BITS(GPIO_PIN_MUX_REG[psram_io->flash_cs_io],  FUN_DRV_V, 3, FUN_DRV_S);
        SET_PERI_REG_BITS(GPIO_PIN_MUX_REG[psram_io->flash_clk_io], FUN_DRV_V, 3, FUN_DRV_S);
        SET_PERI_REG_BITS(GPIO_PIN_MUX_REG[psram_io->psram_cs_io],  FUN_DRV_V, 3, FUN_DRV_S);
        SET_PERI_REG_BITS(GPIO_PIN_MUX_REG[psram_io->psram_clk_io], FUN_DRV_V, 3, FUN_DRV_S);
        SET_PERI_REG_BITS(GPIO_PIN_MUX_REG[psram_io->psram_spiq_sd0_io],  FUN_DRV_V, 3, FUN_DRV_S);
        SET_PERI_REG_BITS(GPIO_PIN_MUX_REG[psram_io->psram_spid_sd1_io],  FUN_DRV_V, 3, FUN_DRV_S);
        SET_PERI_REG_BITS(GPIO_PIN_MUX_REG[psram_io->psram_spihd_sd2_io], FUN_DRV_V, 3, FUN_DRV_S);
        SET_PERI_REG_BITS(GPIO_PIN_MUX_REG[psram_io->psram_spiwp_sd3_io], FUN_DRV_V, 3, FUN_DRV_S);
    }

    // Reserve psram pins
    esp_gpio_reserve(BIT64(psram_io->flash_clk_io)        |
                     BIT64(psram_io->flash_cs_io)         |
                     BIT64(psram_io->psram_clk_io)        |
                     BIT64(psram_io->psram_cs_io)         |
                     BIT64(psram_io->psram_spiq_sd0_io)   |
                     BIT64(psram_io->psram_spid_sd1_io)   |
                     BIT64(psram_io->psram_spihd_sd2_io)  |
                     BIT64(psram_io->psram_spiwp_sd3_io));
}

//used in UT only
bool psram_is_32mbit_ver0(void)
{
    return PSRAM_IS_32MBIT_VER0(s_psram_id);
}

/*
 * Psram mode init will overwrite original flash speed mode, so that it is possible to change psram and flash speed after OTA.
 * Flash read mode(QIO/QOUT/DIO/DOUT) will not be changed in app bin. It is decided by bootloader, OTA can not change this mode.
 */
static esp_err_t IRAM_ATTR s_probe(void)   //psram init
{
    psram_vaddr_mode_t vaddrmode = PSRAM_MODE;
    psram_cache_speed_t mode = PSRAM_SPEED;
    psram_io_t psram_io = {0};
    uint32_t pkg_ver = efuse_ll_get_chip_ver_pkg();
    if (pkg_ver == EFUSE_RD_CHIP_VER_PKG_ESP32D2WDQ5) {
        ESP_EARLY_LOGI(TAG, "This chip is ESP32-D2WD");
        rtc_vddsdio_config_t cfg = rtc_vddsdio_get_config();
        if (cfg.tieh != RTC_VDDSDIO_TIEH_1_8V) {
            ESP_EARLY_LOGE(TAG, "VDDSDIO is not 1.8V");
            return ESP_FAIL;
        }
        psram_io.psram_clk_io = D2WD_PSRAM_CLK_IO;
        psram_io.psram_cs_io  = D2WD_PSRAM_CS_IO;
    } else if (pkg_ver == EFUSE_RD_CHIP_VER_PKG_ESP32PICOD4 && ESP_CHIP_REV_ABOVE(efuse_hal_chip_revision(), 300)) {
        ESP_EARLY_LOGE(TAG, "This chip is ESP32-PICO-V3. It does not support PSRAM (disable it in Kconfig)");
        return ESP_FAIL;
    } else if ((pkg_ver == EFUSE_RD_CHIP_VER_PKG_ESP32PICOD4) || (pkg_ver == EFUSE_RD_CHIP_VER_PKG_ESP32U4WDH)) {
        ESP_EARLY_LOGI(TAG, "This chip is %s",
                       (pkg_ver == EFUSE_RD_CHIP_VER_PKG_ESP32PICOD4) ? "ESP32-PICO" : "ESP32-U4WDH");
        // We have better alternatives, though it's possible to use U4WDH together with PSRAM.
        // U4WDH shares the same pin config with PICO for historical reasons.
        rtc_vddsdio_config_t cfg = rtc_vddsdio_get_config();
        if (cfg.tieh != RTC_VDDSDIO_TIEH_3_3V) {
            ESP_EARLY_LOGE(TAG, "VDDSDIO is not 3.3V");
            return ESP_FAIL;
        }
        psram_io.psram_clk_io = PICO_PSRAM_CLK_IO;
        psram_io.psram_cs_io  = PICO_PSRAM_CS_IO;
    } else if (pkg_ver == EFUSE_RD_CHIP_VER_PKG_ESP32PICOV302) {
        ESP_EARLY_LOGI(TAG, "This chip is ESP32-PICO-V3-02");
        rtc_vddsdio_config_t cfg = rtc_vddsdio_get_config();
        if (cfg.tieh != RTC_VDDSDIO_TIEH_3_3V) {
            ESP_EARLY_LOGE(TAG, "VDDSDIO is not 3.3V");
            return ESP_FAIL;
        }
        psram_io.psram_clk_io = PICO_V3_02_PSRAM_CLK_IO;
        psram_io.psram_cs_io  = PICO_V3_02_PSRAM_CS_IO;
    } else if ((pkg_ver == EFUSE_RD_CHIP_VER_PKG_ESP32D0WDQ6) || (pkg_ver == EFUSE_RD_CHIP_VER_PKG_ESP32D0WDQ5)) {
        ESP_EARLY_LOGI(TAG, "This chip is ESP32-D0WD");
        psram_io.psram_clk_io = D0WD_PSRAM_CLK_IO;
        psram_io.psram_cs_io  = D0WD_PSRAM_CS_IO;
    } else if (pkg_ver == EFUSE_RD_CHIP_VER_PKG_ESP32D0WDR2V3) {
        ESP_EARLY_LOGI(TAG, "This chip is ESP32-D0WDR2-V3");
        rtc_vddsdio_config_t cfg = rtc_vddsdio_get_config();
        if (cfg.tieh != RTC_VDDSDIO_TIEH_3_3V) {
            ESP_EARLY_LOGE(TAG, "VDDSDIO is not 3.3V");
            return ESP_FAIL;
        }
        psram_io.psram_clk_io = D0WDR2_V3_PSRAM_CLK_IO;
        psram_io.psram_cs_io  = D0WDR2_V3_PSRAM_CS_IO;
    } else {
        ESP_EARLY_LOGE(TAG, "Not a valid or known package id: %" PRIu32, pkg_ver);
        abort();
    }
    s_psram_cs_io = psram_io.psram_cs_io;

    const uint32_t spiconfig = esp_rom_efuse_get_flash_gpio_info();
    if (spiconfig == ESP_ROM_EFUSE_FLASH_DEFAULT_SPI) {
        psram_io.flash_clk_io       = MSPI_IOMUX_PIN_NUM_CLK;
        psram_io.flash_cs_io        = MSPI_IOMUX_PIN_NUM_CS0;
        psram_io.psram_spiq_sd0_io  = PSRAM_SPIQ_SD0_IO;
        psram_io.psram_spid_sd1_io  = PSRAM_SPID_SD1_IO;
        psram_io.psram_spiwp_sd3_io = PSRAM_SPIWP_SD3_IO;
        psram_io.psram_spihd_sd2_io = PSRAM_SPIHD_SD2_IO;
    } else if (spiconfig == ESP_ROM_EFUSE_FLASH_DEFAULT_HSPI) {
        psram_io.flash_clk_io       = FLASH_HSPI_CLK_IO;
        psram_io.flash_cs_io        = FLASH_HSPI_CS_IO;
        psram_io.psram_spiq_sd0_io  = PSRAM_HSPI_SPIQ_SD0_IO;
        psram_io.psram_spid_sd1_io  = PSRAM_HSPI_SPID_SD1_IO;
        psram_io.psram_spiwp_sd3_io = PSRAM_HSPI_SPIWP_SD3_IO;
        psram_io.psram_spihd_sd2_io = PSRAM_HSPI_SPIHD_SD2_IO;
    } else {
        psram_io.flash_clk_io       = EFUSE_SPICONFIG_RET_SPICLK(spiconfig);
        psram_io.flash_cs_io        = EFUSE_SPICONFIG_RET_SPICS0(spiconfig);
        psram_io.psram_spiq_sd0_io  = EFUSE_SPICONFIG_RET_SPIQ(spiconfig);
        psram_io.psram_spid_sd1_io  = EFUSE_SPICONFIG_RET_SPID(spiconfig);
        psram_io.psram_spihd_sd2_io = EFUSE_SPICONFIG_RET_SPIHD(spiconfig);
        psram_io.psram_spiwp_sd3_io = bootloader_flash_get_wp_pin();
    }

    if (psram_io.flash_clk_io == psram_io.psram_clk_io) {
        s_clk_mode = PSRAM_CLK_MODE_NORM;
    } else {
        s_clk_mode = PSRAM_CLK_MODE_DCLK;
    }

    assert(mode < PSRAM_CACHE_MAX && "we don't support any other mode for now.");
    s_psram_mode = mode;

    WRITE_PERI_REG(SPI_EXT3_REG(0), 0x1);
    CLEAR_PERI_REG_MASK(SPI_USER_REG(PSRAM_SPI_1), SPI_USR_PREP_HOLD_M);

